---
kind: type
id: T:Autodesk.Revit.DB.SpatialElementGeometryResults
source: html/150ca07e-90b0-506f-9b9c-fd39d194a7ea.htm
---
# Autodesk.Revit.DB.SpatialElementGeometryResults

The results of spatial element geometry calculation.

## Syntax (C#)
```csharp
public class SpatialElementGeometryResults : IDisposable
```

## Remarks
The subfaces of a SpatialElement at the base height and top height are not associated with floors, roofs, and ceilings at the same height.